In [1]:
# https://dplyr.tidyverse.org/reference/distinct.html
from datar.datasets import starwars
from datar.all import *

In [2]:
df = tibble(
  x=sample(range(10), 100, replace=True),
  y=sample(range(10), 100, replace=True)
)
nrow(df)

100

In [3]:
nrow(distinct(df))

58

In [4]:
df >> distinct(f.x, f.y) >> nrow()

58

In [5]:
df >> distinct(f.x)

   x
0  8
1  5
2  1
3  9
4  0
5  4
6  7
7  2
8  3
9  6

In [6]:
df >> distinct(f.y)

   y
0  1
1  3
2  5
3  0
4  4
5  2
6  9
7  8
8  7
9  6

In [7]:
df >> distinct(f.x, _keep_all=True)

   x  y
0  8  1
1  5  3
2  1  5
3  9  2
4  0  3
5  4  5
6  7  2
7  2  7
8  3  6
9  6  4

In [8]:
df >> distinct(f.y, _keep_all=True)

   x  y
0  8  1
1  5  3
2  1  5
3  1  0
4  5  4
5  9  2
6  5  9
7  8  8
8  2  7
9  3  6

In [9]:
df >> distinct(diff=abs(f.x-f.y))

   diff
0     7
1     2
2     4
3     1
4     3
5     5
6     0
7     8
8     9
9     6

In [10]:
starwars >> distinct(across(contains("color")))

   hair_color   skin_color eye_color
0       blond         fair      blue
1         NaN         gold    yellow
2         NaN  white, blue       red
3        none        white    yellow
4       brown        light     brown
..        ...          ...       ...
62       none         pale     white
63      black         dark      dark
64      brown        light     hazel
65       none         none     black
66    unknown      unknown   unknown

[67 rows x 3 columns]

In [12]:
df = tibble(
  g=[1, 1, 2, 2],
  x=[1, 1, 2, 1]
) >> group_by(f.g)

df >> distinct(f.x) >> showme()

[2021-03-13 00:31:48][datar][   INFO] # [DataFrameGroupBy] Groups: ['g'] (2)

   g  x
0  1  1
1  2  2
2  2  1